snlkuharlocal/src/Documents/ПланПродаж2/ПланПродаж2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПродаж2</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ПланПродаж2</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Детальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИзмененияКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗапас</name>
      <comment>Товарный запас в днях торговли</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/Распределение/Распределение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Распределение</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ПланПродаж2/ПланПродаж2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланПродаж2</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Catalogs/Календарь/Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Календарь</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Дни</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныйДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаВВыходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФизическогоУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическийСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>EnumRef.ВидСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбмена77</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШКПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбменаПеремещениями</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <comment>Приоритет для сортировки в отчетах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКратности</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборПечатныхФорм</name>
    <type>
      <types>CatalogRef.НаборыПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПути</name>
    <comment>Склад для оприходования товара который не доехал, или еще не принят складом</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>НеНачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузкиТранзитом</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныйОтдел</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладБухгалтерии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляРаспределенияЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапретаОтправкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольГрафикаОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДляПеремещений</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НужноПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НужнаТермоусадка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВозвратаСКомиссии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КарантинЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладFBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладМаркированногоТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтрольКратностиНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольКратности</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ПланПродаж2/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=Ложь;
		
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;		

	Если Отказ Тогда Возврат КонецЕсли;
		
	Если ЕстьИзменения Тогда 
		ТипТовара			= Брэнд.Родитель;		
		КоличествоДокумента = Состав.Итог("Количество");
		СуммаДокумента		= Состав.Итог("Всего");
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект,"Состав",?(Детальный,"Номенклатура","Модель"));
		
		Состав.Сортировать("ТипТовара,Брэнд,Модель,Номенклатура");
		
		НужноВыгружать		= Истина;
	Иначе
		Если (НЕ Ссылка.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) ИЛИ Ссылка.ПометкаУдаления<>ПометкаУдаления Тогда
			НужноВыгружать=Истина;			
		КонецЕсли;		
	КонецЕсли;	
	
	Если НужноВыгружать Тогда
		//крохин начало 09.01.2017
		//документы в филиале не нужны
		//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//крохин конец 09.01.2017	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ЗапросПоДням=Новый Запрос;
	ЗапросПоДням.Текст="
	|ВЫБРАТЬ
	|	КалендарьДни.Дата КАК Дата
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.Ссылка.Период = &Период
	|	И КалендарьДни.Часы > 0
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дата)
	|ПО ОБЩИЕ";
	
	ЗапросПоДням.УстановитьПараметр("Период",НачалоМесяца(Дата));
	РезультатПоДням	=ЗапросПоДням.Выполнить();
	
	ВсегоДней=0;
	
	ВыборкаПоДням	=РезультатПоДням.Выбрать();
	Пока ВыборкаПоДням.Следующий() Цикл
		Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда
			ВсегоДней=ВыборкаПоДням.Дата;			
		Иначе					
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	Если ВсегоДней=0 Тогда
		Сообщить("Не заполнен календарь на: " +ПредставлениеПериода(НачалоМесяца(Дата),КонецМесяца(Дата)),СтатусСообщения.Важное);					
		Отказ=Истина;
		Возврат;			
	КонецЕсли;
	
	КоэффКурса=глПересчет(1,Валюта,Курс,ПараметрыСеанса.ВалютаНац,Дата);	
	//	
	//Если НЕ Детальный Тогда
	//	Запрос=Новый Запрос;
	//	
	//	//нечаева 28,08,14 добавила еще один склад +++
	//	Запрос.Текст="
	//	|ВЫБРАТЬ
	//	|	ПланПродажСостав.Модель КАК Модель,
	//	|	РаспределениеСрезПоследних.Номенклатура,
	//	|	ПланПродажСостав.Количество КАК Количество,
	//	|	РаспределениеСрезПоследних.Процент КАК Процент,	
	//	|	ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 КАК План
	//	|ИЗ
	//	|	Документ.ПланПродаж2.Состав КАК ПланПродажСостав
	//	|ЛЕВОЕ СОЕДИНЕНИЕ 
	//	|	РегистрСведений.Распределение.СрезПоследних(&Дата2,(Склад=&Склад или Склад=&Склад2)) КАК РаспределениеСрезПоследних
	//	|ПО 
	//	|	ПланПродажСостав.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
	//	|ГДЕ
	//	|	ПланПродажСостав.Ссылка = &Ссылка		
	//	|ИТОГИ
	//	|	СУММА(Количество), 
	//	|	СУММА(План), 
	//	|	СУММА(Процент)
	//	|ПО Модель"
	//	;
	//	
	//	Запрос.УстановитьПараметр("Дата2",	КонецДня(Дата));
	//	Запрос.УстановитьПараметр("Склад",	Справочники.Склады.НайтиПоКоду("SSW-58")); //Чирков 04.12.13 по просьбе Покидышева - Шарапово 4 всегда
	//	Запрос.УстановитьПараметр("Склад2",	Справочники.Склады.НайтиПоКоду("SSZ-13")); //нечаева 28,05,14 склад поменялся
	//	//нечаева 28,08,14 добавила еще один склад ---
	//	Запрос.УстановитьПараметр("Ссылка",	Ссылка);
	
		СкладРаспределенияФилиал=Ложь;
	Если НЕ Детальный Тогда
		
		// 01.09.14 ++++  если есть по филиалу, распределение, то делаем проводки по нему. Нечаева
		//нечаева 28,08,14 добавила еще один склад +++
		
		//проверим есть ли распределение по складу.
		
		// 07,11,2014 +++ добавила Номенкл.
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	РаспределениеСрезПоследних.Номенклатура,
		             |	РаспределениеСрезПоследних.Процент КАК Процент
		             |ИЗ
		             |	РегистрСведений.Распределение.СрезПоследних(
		             |			&Дата2,
		             |			Склад = &Склад
		             |				И Номенклатура В ИЕРАРХИИ (&номенклатура)) КАК РаспределениеСрезПоследних"
		;
		
		Запрос.УстановитьПараметр("Дата2",	КонецДня(Дата));
		Запрос.УстановитьПараметр("Склад",	Склад);
		СписокНоменклатуры = Новый СписокЗначений;
		СписокНоменклатуры = ЭтотОбъект.Состав.ВыгрузитьКолонку("Модель");
		
		Запрос.УстановитьПараметр("Номенклатура",	СписокНоменклатуры);
		// 07,11,2014 ----
			
		
		Рез=Запрос.Выполнить().Выгрузить();		
		Если Рез.Количество()>0 Тогда 
			СкладРаспределенияФилиал=Истина;
		иначе	
			СкладРаспределенияФилиал=Ложь;
		КонецЕсли;
		
		
		Если НЕ СкладРаспределенияФилиал Тогда
			Запрос=Новый Запрос;
			
			//нечаева 28,08,14 добавила еще один склад +++
			Запрос.Текст="
			|ВЫБРАТЬ
			|	ПланПродажСостав.Модель КАК Модель,
			|	РаспределениеСрезПоследних.Номенклатура,
			|	ПланПродажСостав.Количество КАК Количество,
			|	РаспределениеСрезПоследних.Процент КАК Процент,	
			|	ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 КАК План
			|ИЗ
			|	Документ.ПланПродаж2.Состав КАК ПланПродажСостав
			|ЛЕВОЕ СОЕДИНЕНИЕ 
			//крохин начало 13.01.2016
			//|	РегистрСведений.Распределение.СрезПоследних(&Дата2,(Склад=&Склад или Склад=&Склад2)) КАК РаспределениеСрезПоследних
			|	РегистрСведений.Распределение.СрезПоследних(&Дата2,(Склад=&Склад или Склад=&Склад2 или Склад=&Склад3)) КАК РаспределениеСрезПоследних
			//крохин конец 13.01.2016
			|ПО 
			|	ПланПродажСостав.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
			|ГДЕ
			|	ПланПродажСостав.Ссылка = &Ссылка		
			|ИТОГИ
			|	СУММА(Количество), 
			|	СУММА(План), 
			|	СУММА(Процент)
			|ПО Модель"
			;
			
			Запрос.УстановитьПараметр("Дата2",	КонецДня(Дата));
			Запрос.УстановитьПараметр("Склад",	Справочники.Склады.НайтиПоКоду("SSW-58")); //Чирков 04.12.13 по просьбе Покидышева - Шарапово 4 всегда
			Запрос.УстановитьПараметр("Склад2",	Справочники.Склады.НайтиПоКоду("SSZ-13")); //нечаева 28,05,14 склад поменялся
			//крохин начало 13.01.2016
			//ещё раз склад поменялся
			Запрос.УстановитьПараметр("Склад3",	Справочники.Склады.НайтиПоКоду("STA-48")); //нечаева 28,05,14 склад поменялся
			//крохин конец 13.01.2016
			//Запрос.УстановитьПараметр("Склад3",	Справочники.Склады.НайтиПоКоду("SNL-82")); //1 склад
			Запрос.УстановитьПараметр("Ссылка",	Ссылка);
				
			
		Иначе
			
			Запрос=Новый Запрос;
			
			Запрос.Текст="
			|ВЫБРАТЬ
			|	ПланПродажСостав.Модель КАК Модель,
			|	РаспределениеСрезПоследних.Номенклатура,
			|	ПланПродажСостав.Количество КАК Количество,
			|	РаспределениеСрезПоследних.Процент КАК Процент,	
			|	ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 КАК План
			|ИЗ
			|	Документ.ПланПродаж2.Состав КАК ПланПродажСостав
			|ЛЕВОЕ СОЕДИНЕНИЕ 
			|	РегистрСведений.Распределение.СрезПоследних(&Дата2,(Склад=&Склад)) КАК РаспределениеСрезПоследних
			|ПО 
			|	ПланПродажСостав.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
			|ГДЕ
			|	ПланПродажСостав.Ссылка = &Ссылка		
			|ИТОГИ
			|	СУММА(Количество), 
			|	СУММА(План), 
			|	СУММА(Процент)
			|ПО Модель"
			;
			//склад филиала
			Запрос.УстановитьПараметр("Дата2",	КонецДня(Дата));
			Запрос.УстановитьПараметр("Склад",	Склад); 
			Запрос.УстановитьПараметр("Ссылка",	Ссылка);
			
				
		КонецЕсли;
		// 01.09.14 ++++  если есть по филиалу, распределение, то делаем проводки по нему. Нечаева ----------
		
		
		
		КэшЦен=Новый Соответствие;
		
		ВыборкаПоМоделям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
		Пока ВыборкаПоМоделям.Следующий() Цикл		
			Если ВыборкаПоМоделям.Количество=0 Тогда Продолжить КонецЕсли; 
			
			Если ВыборкаПоМоделям.План=Null ИЛИ ВыборкаПоМоделям.План=0 Тогда
				Сообщить("Не задано распределение по модели: "+ВыборкаПоМоделям.Модель.Родитель+"/"+ВыборкаПоМоделям.Модель,СтатусСообщения.Важное);
				Отказ=Истина;
				Продолжить;	
			КонецЕсли;		
			
			ИтогоРасчКол=0;
			ИтогоФактКол=0;
			КоэффициентКорректировки=100/ВыборкаПоМоделям.Процент;
			
			Модель	= ВыборкаПоМоделям.Модель;
			Цена	= КэшЦен.Получить(Модель);
			
			Если Цена=Неопределено Тогда
				СтрокаТЧ=Состав.Найти(Модель,"Модель");
				Если СтрокаТЧ<>Неопределено Тогда
					Цена=СтрокаТЧ.Цена;
					КэшЦен.Вставить(Модель,Цена);
				Иначе
					Цена=0;
				КонецЕсли; 
			КонецЕсли; 
						
			ВыборкаПоТоварам=ВыборкаПоМоделям.Выбрать();	
			Пока ВыборкаПоТоварам.Следующий() Цикл
				Если ВыборкаПоТоварам.План=Null или ВыборкаПоТоварам.План=0 Тогда Продолжить КонецЕсли;			
				
				ВыборкаПоДням=РезультатПоДням.Выбрать();			
				Пока ВыборкаПоДням.Следующий() Цикл
					Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда Продолжить КонецЕсли;					
					
					Движение=Движения.ПланПродаж2.Добавить();
					
					//крохин начало 11.09.2012
					//акция формирует проводки на одну дату
					//Движение.Период			=ВыборкаПоДням.Дата;
					Если НЕ Акция Тогда
						Движение.Период			=ВыборкаПоДням.Дата;
					Иначе
						Движение.Период			=Дата;
					КонецЕсли;
					//крохин конец 11.09.2012
					
					Движение.Подразделение	=Подразделение;
					Движение.Склад			=Склад;
					Движение.Номенклатура	=ВыборкаПоТоварам.Номенклатура;
					Движение.Контрагент     =Контрагент;					
					
					РасчКол				=ВыборкаПоТоварам.План/ВсегоДней*КоэффициентКорректировки;			
					Движение.Количество	=РасчКол;
					
					ИтогоРасчКол		=ИтогоРасчКол+РасчКол;
					ИтогоФактКол		=ИтогоФактКол+Движение.Количество;
					
					Корректировка=Окр(ИтогоРасчКол-ИтогоФактКол,0,1);
					Если Корректировка<>0 Тогда
						Движение.Количество	=Движение.Количество+Корректировка;
						ИтогоФактКол		=ИтогоФактКол+Корректировка;					
					КонецЕсли;				
					
					Движение.Сумма			=Движение.Количество*Цена*КоэффКурса;
					
					Если Движение.Количество=0 Тогда
						Движения.ПланПродаж2.Удалить(Движение);											
					КонецЕсли; 
				КонецЦикла;			
			КонецЦикла;
		КонецЦикла;			
	Иначе
		Для Каждого СтрокаТЧ Из Состав Цикл
			ИтогоРасчКол=0;
			ИтогоФактКол=0;		
			
			ВыборкаПоДням=РезультатПоДням.Выбрать();			
			Пока ВыборкаПоДням.Следующий() Цикл
				Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда Продолжить КонецЕсли;
				
				Движение=Движения.ПланПродаж2.Добавить();			
				
				//крохин начало 11.09.2012
				//акция формирует проводки на одну дату
				//Движение.Период			=ВыборкаПоДням.Дата;
				Если НЕ Акция Тогда
					Движение.Период			=ВыборкаПоДням.Дата;
				Иначе
					Движение.Период			=Дата;
				КонецЕсли;
				//крохин конец 11.09.2012
				
				Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
				Движение.Подразделение	=Подразделение;
				Движение.Склад			=Склад;
				Движение.Контрагент     =Контрагент;		
				
				РасчКол					=СтрокаТЧ.Количество/ВсегоДней;			
				Движение.Количество		=РасчКол;
				
				ИтогоРасчКол			=ИтогоРасчКол+РасчКол;
				ИтогоФактКол			=ИтогоФактКол+Движение.Количество;
				
				Корректировка=Окр(ИтогоРасчКол-ИтогоФактКол,0,1);
				Если Корректировка<>0 Тогда
					Движение.Количество	=Движение.Количество+Корректировка;
					ИтогоФактКол		=ИтогоФактКол+Корректировка;					
				КонецЕсли;				
				
				Движение.Сумма			=Движение.Количество*СтрокаТЧ.Цена*КоэффКурса;				
				
				Если Движение.Количество=0 Тогда
					Движения.ПланПродаж2.Удалить(Движение);											
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;	
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Движения.ПланПродаж2.Записать();	
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Валюта 	= Основание.Валюта;
		ИБ 		= Основание.ИБ;
		Склад 	= Основание.Склад;
		ТипЦен 	= Основание.ТипЦен;
		
		Для Каждого СтрокаИст Из Основание.Товары  Цикл
			Если СтрокаИст.Количество=0 Тогда Продолжить КонецЕсли;
			
			СтрокаТЧ=Состав.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаИст);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры
